Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector
The Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector class provides pour break preview data fetching it from TS Core.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.DotDmPickListLength
The maximum number of input planes for a pour break preview.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.GetSinglePolygonPolymeshes(Tekla.Structures.Model.ModelObject,System.Collections.Generic.IDictionary{Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.UnitVector3},System.Boolean)
Gets the polymeshes (preview or actual) based on the given input.
modelObject: The model object lying under the input planes.
inputPlanes: The input planes defined as pairs of point and normal.
actual: True for actual polymeshes, false for preview.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep objects containing the preview/actual polymeshes if they could be generated
or null if no preview/actual polygons could be generated.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.GetPreviewPolylinePolymeshesForCreation(Tekla.Structures.Model.ModelObject,System.Collections.Generic.IList{Tekla.Common.Geometry.Vector3},Tekla.Common.Geometry.UnitVector3)
Gets the preview polymeshes for the creation of a polyline pour break.
modelObject: The model object under the picked point(s).
polylinePoints: The input polyline points.
extensionDirection: The input extension direction.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep polymeshes if the preview polymeshes could be generated.
Otherwise, null if no preview polymesh could be generated.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.GetActualPolylinePolymeshesForCreation(Tekla.Structures.Model.ModelObject,Tekla.Structures.Geometry3d.FacetedBrep)
Gets the actual geometry polymeshes for the creation of a polyline pour break.
modelObject: The model object lying under the picked point(s).
pourBreakPolymesh: The input polymesh.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep polymeshes if the actual geometry polymeshes could be generated.
Otherwise, null if no actual geometry polymesh could be generated.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.GetPreviewPolylinePolymeshesForSplitting(Tekla.Structures.Model.ModelObject,System.Collections.Generic.IList{Tekla.Common.Geometry.Vector3},Tekla.Common.Geometry.UnitVector3)
Gets the preview polymeshes for the creation of a polyline split
modelObject: The model object (part) under the picked point(s).
polylinePoints: The input polyline points that define the split.
extensionDirection: The input extension direction. The polyline is "extended"
in this direction to create split surface
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep polymeshes if the preview polymeshes could be generated.
Otherwise, null if no preview polymesh could be generated.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.GetActualPolylinePolymeshesForSplitting(Tekla.Structures.Model.ModelObject,Tekla.Structures.Geometry3d.FacetedBrep)
Gets the actual valid geometry polymeshes for the splitting of a part with a polyline
modelObject: The model object lying under the picked point(s).
splitPolymesh: The input polymesh defining the tentative split surface. This will be validated.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep polymeshes if the actual geometry polymeshes could be generated.
Otherwise, null if no actual geometry polymesh could be generated.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.GetPreviewPolylinePolymeshesForModification(Tekla.Structures.Model.PourBreak,System.Collections.Generic.IList{Tekla.Common.Geometry.Vector3},Tekla.Common.Geometry.UnitVector3)
Gets the preview polymeshes for the modification of a pour break.
pourBreak: The pour break being modified.
polylinePoints: The input polyline points.
extensionDirection: The input extension direction.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep polymeshes containing the preview polygons if they could be generated.
Otherwise, null if no preview polymesh could be generated.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.GetActualPolylinePolymeshesForModification(Tekla.Structures.Model.PourBreak,Tekla.Structures.Geometry3d.FacetedBrep)
Gets the actual geometry polymeshes for the modification of a pour break.
pourBreak: The pour break being modified.
pourBreakPolymesh: The input polymesh.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep polymeshes if the actual geometry polymeshes could be generated.
Otherwise, null if no actual polymesh could be generated.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.GetPreviewPolylinePolymesh(System.Int32,System.Collections.Generic.IList{Tekla.Common.Geometry.Vector3},Tekla.Common.Geometry.UnitVector3,Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.GetPreviewPolymeshMethod)
Gets a preview polymesh using the provided method from native dll imports.
id:
The int identifier of the object to be passed to the native call.
polylinePoints:
The input polyline points.
extensionDirection:
The input extension direction.
getPolymeshMethod:
The method in the native dll imports to be called.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep polymeshes containing the preview polyline if they could be generated;
Otherwise, null if no preview polymesh could be generated.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.GetActualPolylinePolymeshes(System.Int32,Tekla.Structures.Geometry3d.FacetedBrep,Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.GetActualPolymeshMethod)
Gets the actual polymeshes using the provided method from native dll imports.
id:
The int identifier of the object to be passed to the native call.
pourBreakPolymesh:
The input polymesh
getPolymeshMethod:
The method in the native dll imports to be called.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep polymeshes if the actual geometry polymeshes could be generated;
Otherwise, null if no actual polymesh could be generated.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.ConstructInputData(System.Collections.Generic.IDictionary{Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.UnitVector3})
Fills the Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t struct based on the given input data.
inputPlanes: The input planes as pairs of point and normal
Returns: A Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t struct filled with the given data.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.ConstructInputData(System.Collections.Generic.IList{Tekla.Common.Geometry.Vector3},Tekla.Common.Geometry.UnitVector3)
Fills the Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t struct based on the given input data.
polylinePoints: The input polyline points.
extensionDirection: The input extension direction.
Returns: A Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t struct filled with the given data.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.ConstructInputData(Tekla.Structures.Geometry3d.FacetedBrep)
Creates polymesh data structure which can be used with TS .NET interface. Data structure is used for converting .NET
polymesh to geometry polymesh. Only single pour break polymesh can be converted.
@see http://b-pdwiki/wiki/File:Polymesh_conversion_data_structure.png
pourBreakPolymesh:
The pour break polymesh.
Returns:
The Tekla.Structures.ModelInternal.dotPolymesh_t.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.ExportIntList(Tekla.Structures.ModelInternal.IntList)
The export int list.
intList:
The int list.
Returns:
The System.Boolean.

Tekla.Structures.DirectManipulation.Model.PourBreakPreviewSelector.ExportPointList(Tekla.Structures.ModelInternal.PointList)
The export point list.
pointList:
The point list.
Returns:
The System.Boolean.